rullinoiz/ATEM_tally_light_with_ESP8266/ATEM_tally_light/ATEM_tally_light.cpp
/*
    Copyright (C) 2023 Aron N. Het Lam, aronhetlam@gmail.com

    This program makes an ESP8266 into a wireless tally light system for ATEM switchers,
    by using Kasper Skårhøj's (<https://skaarhoj.com>) ATEM client libraries for Arduino.

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <https://www.gnu.org/licenses/>.
*/

#include "ATEM_tally_light.hpp"

#ifndef VERSION
#define VERSION "dev"
#endif

// #define DEBUG_LED_STRIP
#define FASTLED_ALLOW_INTERRUPTS 0

#ifndef CHIP_FAMILY
#define CHIP_FAMILY "Unknown"
#endif

#ifndef VERSION
#define VERSION "Unknown"
#endif

#ifdef TALLY_TEST_SERVER
#define DISPLAY_NAME "Tally Test server"
#else
#define DISPLAY_NAME "Tally Light"
#endif

//Include libraries:
#if ESP32
#include <esp_wifi.h>
#include <WebServer.h>
#include <WiFi.h>
#else
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#endif

#include <EEPROM.h>
#include <ATEMmin.h>
#include <TallyServer.h>
#include <FastLED.h>
#include "FastLED_RGBW.h"

#if ESP32
//Define LED1 color pins
#ifndef PIN_RED1
#define PIN_RED1   32
#endif
#ifndef PIN_GREEN1
#define PIN_GREEN1 33
#endif
#ifndef PIN_BLUE1
#define PIN_BLUE1  25
#endif

//Define LED2 color pins
#ifndef PIN_RED2
#define PIN_RED2   26
#endif
#ifndef PIN_GREEN2
#define PIN_GREEN2 27
#endif
#ifndef PIN_BLUE2
#define PIN_BLUE2  14
#endif

#else // ESP8266
//Define LED1 color pins
#ifndef PIN_RED1
#define PIN_RED1    16 // D0
#endif
#ifndef PIN_GREEN1
#define PIN_GREEN1  4  // D2
#endif
#ifndef PIN_BLUE1
#define PIN_BLUE1   5  // D1
#endif

//Define LED2 color pins
#ifndef PIN_RED2
#define PIN_RED2    2  // D4
#endif
#ifndef PIN_GREEN2
#define PIN_GREEN2  14 // D5
#endif
#ifndef PIN_BLUE2
#define PIN_BLUE2   12 // D6
#endif
#endif

//Define LED colors
#define LED_OFF     0
#define LED_RED     1
#define LED_GREEN   2
#define LED_BLUE    3
#define LED_YELLOW  4
#define LED_PINK    5
#define LED_WHITE   6
#define LED_ORANGE  7

//Map "old" LED colors to CRGB colors
CRGB color_led[8] = { CRGB::Black, CRGB::Red, CRGB::Lime, CRGB::Blue, CRGB::Yellow, CRGB::Fuchsia, CRGB::White, CRGB::Orange };

//Define states
#define STATE_STARTING                  0
#define STATE_CONNECTING_TO_WIFI        1
#define STATE_CONNECTING_TO_SWITCHER    2
#define STATE_RUNNING                   3

//Define modes of operation
#define MODE_NORMAL                     1
#define MODE_PREVIEW_STAY_ON            2
#define MODE_PROGRAM_ONLY               3
#define MODE_ON_AIR                     4

#define TALLY_FLAG_OFF                  0
#define TALLY_FLAG_PROGRAM              1
#define TALLY_FLAG_PREVIEW              2

//Define Neopixel status-LED options
#define NEOPIXEL_STATUS_FIRST           1
#define NEOPIXEL_STATUS_LAST            2
#define NEOPIXEL_STATUS_NONE            3

//FastLED
#ifndef TALLY_DATA_PIN
#if ESP32
#define TALLY_DATA_PIN    6
#elif ARDUINO_ESP8266_NODEMCU
#define TALLY_DATA_PIN    7
#else
#define TALLY_DATA_PIN    13 // D7
#endif
#endif
int numTallyLEDs;
int numStatusLEDs;
CRGBW leds[13];
CRGB* ledsRGB = (CRGB *) &leds[0];
CRGBW *tallyLEDs;
CRGBW *statusLED;
bool neopixelsUpdated = false;

//Initialize global variables
#if ESP32
WebServer server(80);
#else
ESP8266WebServer server(80);
#endif

#ifndef TALLY_TEST_SERVER
ATEMmin atemSwitcher;
#else
int tallyFlag = TALLY_FLAG_OFF;
#endif

TallyServer tallyServer;

ImprovWiFi improv(&Serial);

uint8_t state = STATE_STARTING;

//Define struct for holding tally settings (mostly to simplify EEPROM read and write, in order to persist settings)
struct Settings {
    char tallyName[32] = "";
    uint8_t tallyNo;
    uint8_t tallyModeLED1;
    uint8_t tallyModeLED2;
    bool staticIP;
    IPAddress tallyIP;
    IPAddress tallySubnetMask;
    IPAddress tallyGateway;
    IPAddress switcherIP;
    uint16_t neopixelsAmount;
    uint8_t neopixelStatusLEDOption;
    uint8_t neopixelBrightness;
    uint8_t ledBrightness;
};

Settings settings;

bool firstRun = true;

int bytesAvailable = false;
uint8_t readByte;

//Commented out for users without batteries
// long secLoop = 0;
// int lowLedCount = 0;
// bool lowLedOn = false;
// double uBatt = 0;
// char buffer[3];

void onImprovWiFiErrorCb(ImprovTypes::Error err)
{

}

void onImprovWiFiConnectedCb(const char *ssid, const char *password)
{

}

//Perform initial setup on power on
void setup() {
    Serial.begin(115200);
    Serial.println("########################");
    Serial.println("Serial started");

    //Read settings from EEPROM. WIFI settings are stored separately by the ESP
    EEPROM.begin(sizeof(settings)); //Needed on ESP8266 module, as EEPROM lib works a bit differently than on a regular Arduino
    EEPROM.get(0, settings);

    //Initialize LED strip
    if (0 < settings.neopixelsAmount && settings.neopixelsAmount <= 1000) {
        FastLED.addLeds<WS2812B, TALLY_DATA_PIN, RGB>(ledsRGB, getRGBWsize(12));
        FastLED.addLeds<NEOPIXEL, PIN_NEOPIXEL>(((CRGB *) &leds[12]), getRGBWsize(1));

        numStatusLEDs = 1;
        numTallyLEDs = 12;

        statusLED = leds + 12;
        tallyLEDs = leds;
        // if (settings.neopixelStatusLEDOption != NEOPIXEL_STATUS_NONE) {
        //     numStatusLEDs = 1;
        //     numTallyLEDs = settings.neopixelsAmount - numStatusLEDs;
        //     if (settings.neopixelStatusLEDOption == NEOPIXEL_STATUS_FIRST) {
        //         statusLED = leds;
        //         tallyLEDs = leds + numStatusLEDs;
        //     } else { // if last or or other value
        //         statusLED = leds + numTallyLEDs;
        //         tallyLEDs = leds;
        //     }
        // } else {
        //     numTallyLEDs = settings.neopixelsAmount;
        //     numStatusLEDs = 0;
        //     tallyLEDs = leds;
        // }
    } else {
        settings.neopixelsAmount = 0;
        numTallyLEDs = 0;
        numStatusLEDs = 0;
    }

